# 4주차 개인톡 과제
- 행렬 정리

In [1]:
import numpy as np

In [3]:
# 1차원 행렬에 1부터 20까지의 수 중 홀수를 입력하고 4보다 크고 14보다 작은 경우 음수로 만드시오.
array1 = np.arange(1,20,2)
print(array1)

for i in range(10):
    if array1[i]>4 and array1[i]<14:
        array1[i] = array1[i]*(-1)
        
print(array1)

[ 1  3  5  7  9 11 13 15 17 19]
[  1   3  -5  -7  -9 -11 -13  15  17  19]

In [7]:
#행렬을 거꾸로 뒤집으시오
print(np.flip(array1))
print(array1[::-1])

[ 19  17  15 -13 -11  -9  -7  -5   3   1]
[ 19  17  15 -13 -11  -9  -7  -5   3   1]

In [8]:
#2차원 배열 뒤집기
arr_2d = np.arange(9).reshape(3,3)
arr_2d

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [10]:
np.flip(arr_2d)# 행과 열이 모두 역순으로

array([[8, 7, 6],
       [5, 4, 3],
       [2, 1, 0]])

In [11]:
np.flip(arr_2d, axis = 0) # 행만 역순

array([[6, 7, 8],
       [3, 4, 5],
       [0, 1, 2]])

In [12]:
np.flip(arr_2d, axis = 1) # 열만 역순

array([[2, 1, 0],
       [5, 4, 3],
       [8, 7, 6]])

In [13]:
arr_2d[::-1] # 행만 역순

array([[6, 7, 8],
       [3, 4, 5],
       [0, 1, 2]])

In [14]:
arr_2d[:, ::-1] # 열만 역순

array([[2, 1, 0],
       [5, 4, 3],
       [8, 7, 6]])

In [15]:
arr_2d[::-1,::-1] # 행과 열 모두 역순

array([[8, 7, 6],
       [5, 4, 3],
       [2, 1, 0]])

#### 모든 원소가 1로 구성된 [3,4] 크기의 배열 생성
#### 3행 4열을 2행 6열로 바꾸기
#### 열과 행을 바꿔서 출력
#### 원소의 모든 합 구하기

In [21]:
array = np.full((3,4),1)
print(array)
print('=====================')
array_ch = array.reshape(2,6)
print(array_ch)
print('=====================')
print(array_ch.T)
print('=====================')
print(array_ch.sum(dtype = np.float))

[[1 1 1 1]
 [1 1 1 1]
 [1 1 1 1]]
=====================
[[1 1 1 1 1 1]
 [1 1 1 1 1 1]]
=====================
[[1 1]
 [1 1]
 [1 1]
 [1 1]
 [1 1]
 [1 1]]
=====================
12.0

# 5주차 과제

In [22]:
import pandas as pd

In [28]:
iris = pd.read_csv('./data/iris.csv', encoding = 'utf-8-sig')

In [29]:
iris

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [35]:
iris_cm = iris[iris.columns[:len(iris.columns)-1]]*2.5
iris_cm['Species'] = iris['Species']
iris_cm

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,2.5,12.75,8.75,3.50,0.50,Iris-setosa
1,5.0,12.25,7.50,3.50,0.50,Iris-setosa
2,7.5,11.75,8.00,3.25,0.50,Iris-setosa
3,10.0,11.50,7.75,3.75,0.50,Iris-setosa
4,12.5,12.50,9.00,3.50,0.50,Iris-setosa
...,...,...,...,...,...,...
145,365.0,16.75,7.50,13.00,5.75,Iris-virginica
146,367.5,15.75,6.25,12.50,4.75,Iris-virginica
147,370.0,16.25,7.50,13.00,5.00,Iris-virginica
148,372.5,15.50,8.50,13.50,5.75,Iris-virginica
149,375.0,14.75,7.50,12.75,4.50,Iris-virginica

In [37]:
iris_cm.groupby(iris_cm['Species']).mean()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm
Species,,,,,
Iris-setosa,63.75,12.515,8.545,3.66,0.610
Iris-versicolor,188.75,14.840,6.925,10.65,3.315
Iris-virginica,313.75,16.470,7.435,13.88,5.065

In [40]:
f= lambda x:x*2.5
a = ['SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm','PetalWidthCm']

for i in range(0,len(a),):
    iris[a[i]] = iris[a[i]].map(f)
iris1 = iris.groupby('Species').mean()
iris1

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm
Species,,,,,
Iris-setosa,25.5,78.21875,53.40625,22.8750,3.81250
Iris-versicolor,75.5,92.75000,43.28125,66.5625,20.71875
Iris-virginica,125.5,102.93750,46.46875,86.7500,31.65625

# 6주차 과제

In [45]:
import numpy as np
import pandas as pd
import seaborn as sns

In [46]:
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [48]:
# 나이에 따른 그룹화
def q3cut(s):
    return pd.qcut(s, 3, labels = ['low','middle','high'])
titanic['age_class'] = titanic.age.transform(q3cut)

In [49]:
# 나이 그룹에 따른 생존율
group_age = titanic.groupby(['age_class'])

In [51]:
#생존율
group_age['survived'].sum() / group_age['survived'].count()

age_class
low       0.418699
middle    0.400862
high      0.398305
Name: survived, dtype: float64

In [54]:
# 성별에 의한 생존율
group_sex = titanic.groupby(['sex'])
group_sex['survived'].sum()/group_sex['survived'].count()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [56]:
# 객실 등급에 의한 생존율
group_class = titanic.groupby(['class'])
group_class['survived'].mean()

class
First     0.629630
Second    0.472826
Third     0.242363
Name: survived, dtype: float64

In [59]:
# 성별 객실 등급 나이그룹 별 생존율
d = titanic. groupby(['sex','class','age_class'])['survived'].mean()
d

sex     class   age_class
female  First   low          0.954545
                middle       0.947368
                high         0.977273
        Second  low          1.000000
                middle       0.909091
                high         0.857143
        Third   low          0.508475
                middle       0.481481
                high         0.250000
male    First   low          0.500000
                middle       0.500000
                high         0.347826
        Second  low          0.357143
                middle       0.076923
                high         0.062500
        Third   low          0.158879
                middle       0.195652
                high         0.055556
Name: survived, dtype: float64

In [63]:
survived_rate = titanic.groupby(['sex','class'])['survived'].mean()
survived_rate

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [65]:
df = pd.DataFrame({
    'survived' : list(survived_rate),
    'sex': ['female','female','female','male','male','male'],
    'class' : ['First','Second','Thrid','First','Second','Thrid']
})
df

   survived     sex   class
0  0.968085  female   First
1  0.921053  female  Second
2  0.500000  female   Thrid
3  0.368852    male   First
4  0.157407    male  Second
5  0.135447    male   Thrid

In [66]:
df.pivot('sex','class','survived')

class      First    Second     Thrid
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

# 7주차 과제